snlkuharlocal/src/DataProcessors/Трассировка/Трассировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Трассировка</name>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/DataProcessors/Трассировка/ObjectModule.bsl
Функция СформироватьОписаниеОшибки(СтрокаТО)
	Если СтрокаТО.ТипОшибки="Недостаточно товара" Тогда	
		ОписаниеОшибки="Недостаточно товара на момент проведения документа ! Склад: "+СтрокаТО.Склад+",						
		|	в наличии физ. остаток: "+СтрокаТО.Остаток+", резерв: "+СтрокаТО.Резерв+", (факт. остаток: "+(СтрокаТО.Остаток-Макс(СтрокаТО.Резерв,0))+"), требуется: "+СтрокаТО.Количество+" "+СтрокаТО.Номенклатура.БазоваяЕдиница+".";
	Иначе
		ОписаниеОшибки="";		
	КонецЕсли;	
	
	Возврат ОписаниеОшибки;
КонецФункции // СформироватьОписаниеОшибки()
 
Процедура ДобавитьОшибки(ТОшибок,РезультатОперации=0) Экспорт		
	Если ТОшибок=Неопределено Тогда Возврат КонецЕсли; 
	
	ТОбъектов=ТОшибок.Скопировать();
	ТОбъектов.Колонки.Добавить("Кол");
	ТОбъектов.Свернуть("Объект","Кол");
	
	Для Каждого СтрокаОбъекта Из ТОбъектов Цикл
		СтрокиОшибок=Ошибки.НайтиСтроки(Новый Структура("Объект",СтрокаОбъекта.Объект));	
		Для Каждого СтрокаОшибок Из СтрокиОшибок Цикл
			Ошибки.Удалить(СтрокаОшибок);		
		КонецЦикла;	
	КонецЦикла; 
	
	Для Каждого СтрокаТО Из ТОшибок Цикл		
		Строка=Ошибки.Добавить();		
		
		ЗаполнитьЗначенияСвойств(Строка,СтрокаТО);
		
		Строка.ДатаРегистрации	=ТекущаяДата();
		Строка.ОписаниеОшибки	=СформироватьОписаниеОшибки(СтрокаТО);
		Строка.РезультатОперации=РезультатОперации;
		
		Если СтрокаТО.ТипОшибки="Недостаточно товара" Тогда	
			Строка.Расшифровка=""+СтрокаТО.Номенклатура;
		КонецЕсли;		
	КонецЦикла; 	
КонецПроцедуры
